#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-yR7Ucr9oTMMAY9Ad

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.database.random_password.database_admin_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=5b26b697-bd46-8986-882e-8d464a869dcd]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=1f925157-0a72-7ffc-0dc5-688f3f39570f]
module.infrastructure.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:165140526436:certificate/6d1df110-35b3-4c16-ab1b-9479191ac636]
module.kubernetes.aws_vpc.main: Refreshing state... [id=vpc-08c4330d865dc7409]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.frontend_preprod.aws_s3_bucket.main: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch: Refreshing state... [id=elasticsearch]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.kubernetes.aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
module.kubernetes.aws_iam_role.service_workers: Refreshing state... [id=eks-node-group-service]
module.infrastructure.module.database.aws_db_instance.fluentlabs: Refreshing state... [id=fluentlabs]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.elasticsearch.aws_s3_bucket.backup: Refreshing state... [id=fluentlabs-elasticsearch-backups]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=fluentlabs-content]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSERLYTV5P]
module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch: Refreshing state... [id=AKIASM4ZEOVSI6VLF73T]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSADUQ77GK]
module.kubernetes.aws_iam_role_policy_attachment.eks_vpc_controller: Refreshing state... [id=eks-cluster-role-20210718103605121000000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-cluster-role-20210718103605118700000001]
module.kubernetes.aws_iam_role_policy_attachment.eks_cni_policy_worker: Refreshing state... [id=eks-node-group-service-20210718103029423400000002]
module.kubernetes.aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-node-group-service-20210718103029414600000001]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIASM4ZEOVSEBHLP4HO]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials: Refreshing state... [id=default/elasticsearch-s3-creds]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns: Refreshing state... [id=151240494]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.kubernetes.aws_subnet.public[0]: Refreshing state... [id=subnet-03d64ea688089e7e8]
module.kubernetes.aws_subnet.public[1]: Refreshing state... [id=subnet-0c64eade2a7db2bb4]
module.kubernetes.aws_subnet.public[2]: Refreshing state... [id=subnet-09bfc938045329b49]
module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.elasticsearch.elasticsearch_user.api: Refreshing state... [id=apiprod]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.elasticsearch.elasticsearch_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.elasticsearch.elasticsearch_user.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups: Refreshing state... [id=S3-backup]
module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup: Refreshing state... [id=arn:aws:iam::165140526436:policy/elasticsearch-backup-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-write-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-read-role]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_lifecycle_policy.daily_backup: Refreshing state... [id=daily-snapshots]
module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup: Refreshing state... [id=elasticsearch-backup-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_index_lifecycle_policy.rollover: Refreshing state... [id=logging-rollover]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=151240493]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.kubernetes.aws_eks_cluster.fluentlabs will be created
  + resource "aws_eks_cluster" "fluentlabs" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "fluentlabs-prod"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::165140526436:role/eks-cluster-role"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-03d64ea688089e7e8",
              + "subnet-09bfc938045329b49",
              + "subnet-0c64eade2a7db2bb4",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.kubernetes.aws_eks_node_group.services will be created
  + resource "aws_eks_node_group" "services" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "fluentlabs-prod"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "services"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::165140526436:role/eks-node-group-service"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03d64ea688089e7e8",
          + "subnet-09bfc938045329b49",
          + "subnet-0c64eade2a7db2bb4",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 5
          + min_size     = 1
        }
    }

  # module.infrastructure.module.content.helm_release.spark will be created
  + resource "helm_release" "spark" {
      + atomic                     = false
      + chart                      = "spark-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "spark"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://googlecloudplatform.github.io/spark-on-k8s-operator"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                webhook:
                  enable: true
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd will be updated in-place
  ~ resource "elasticsearch_index_template" "fluentd" {
        id       = "fluentd"
        name     = "fluentd"
      ~ template = jsonencode(
          ~ {
              - fluentd        = {
                  - aliases        = {}
                  - index_patterns = [
                      - "logstash-*",
                    ]
                  - mappings       = {}
                  - order          = 0
                  - settings       = {
                      - index = {
                          - lifecycle = {
                              - name           = "logging-rollover"
                              - rollover_alias = "logstash-backup-alias"
                            }
                        }
                    }
                } -> null
              + index_patterns = [
                  + "logstash-*",
                ]
              + settings       = {
                  + index.lifecycle.name           = "logging-rollover"
                  + index.lifecycle.rollover_alias = "logstash-backup-alias"
                }
            }
        )
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `__hashicorp_terraform-github-actions_4`, Working Directory: `.`, Workspace: `default`*
